# Offset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudType..::..Offset Property
PointCloudType Class See Also
---
Returns the offset stored in the point cloud.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public XYZ Offset { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Offset As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Offset {
	XYZ^ get ();
}
```

# Remarks
All points are assumed to be offset by the same offset vector. The offset will be used by Revit if the user chooses to place an instance relative to another point cloud (the "Auto - Origin To Last Placed" placement option).
# See Also
PointCloudType Class
Autodesk.Revit.DB Namespace